#define _DECODE_C_

//----------------------------------------------------------------------------- ----------------------------------------
#include "class/audio/audio.h"
#include "class/midi/midi.h"

enum {
	TUSB_CLASS_AUDIO_UNDEFINED      = 0x00,
	TUSB_CLASS_AUDIO_AUDIO_CONTROL  = 0x01,
	TUSB_CLASS_AUDIO_AUDIOSTREAMING = 0x02,
	TUSB_CLASS_AUDIO_MIDISTREAMING  = 0x03,
} audio_subclass_t;

enum {
	TUSB_CLASS_HID_NONE           = 0x00,
	TUSB_CLASS_HID_BOOT_INTERFACE = 0x01,
} hid_subclass_t;

// B.5.2 Class-specific MS Bulk OUT Endpoint Descriptor
// B.6.2 Class-specific MS Bulk IN  Endpoint Descriptor
typedef
	struct TU_ATTR_PACKED {
		uint8_t  bLength;            // Size of this descriptor, in bytes.
		uint8_t  bDescriptorType;    // CS_ENDPOINT descriptor
		uint8_t  bDescriptorSubtype; // MS_GENERAL subtype.
		uint8_t  bNrEmbMIDIJack;     // Number of embedded MIDI IN Jacks.
		uint8_t  baAssocJackID;      // ID of the Embedded MIDI IN Jack.
	}
audio_cs_ms_bulk_ep_t;

#define TUSB_STRING_MAX  (((255 - 2) / 2) +1)  // maxPktSz=255, usedBytes=2, unicode=2, NUL=1

#define IND  "? "    // indent string
#define EOL  "\r\n"  // end of line

//----------------------------------------------------------------------------- ----------------------------------------
static int(*declogf)(const char* fmt, ...) = NULL;  // NULL=Logging disabled

//+============================================================================ ========================================
// Set logging function
//
void  dec_logfSet(int(*fn)(const char* const fmt, ...))
{
	declogf = fn;
}

//+============================================================================ ========================================
// Hexdump function
//
void  dec_hexdump (const char* const msg,  const uint16_t len,  const void* const buf)
{
	declogf("%c [%04X]--%s::%s", *msg, len, (*msg == '>') ? "Tx" : "Rx", msg+1);

	const uint8_t*  bp = buf;

	for (uint16_t i = 0;  i < len;  i++) {
		if      (!(i & 0xF))  declogf(EOL "%c  %04X:  ", *msg, i) ;
		else if (!(i & 0x7))  declogf("  ") ;
		else if (!(i & 0x3))  declogf(" ") ;
		declogf("%02x ", *bp++);
	}
	declogf("%s", EOL);
}

//+============================================================================ ========================================
// Print a STRING DESCRIPTOR as if it were Unicode encoded ASCII
// ...this will probably work more than you might expect
// ...if not, you'll just get a string of ?'s and have to look at the hex dump
//
char*  dec_unicode2asc (const void* const vp,  int len,  char* s,  int max)
{
	const uint8_t*  from   = vp;          //! +1 if the data is big-endian
	const uint8_t*  fromNd = from + len;

	char*           to     = s;
	char* const     toNd   = to + max;

	for ( ;  (from < fromNd) && (to < toNd);  from +=2 , to++)
		*to = ((*from >= 32) && (*from <= 126)) ? *from : '?' ;
	*to = '\0';

	return s;
}

//+============================================================================ ========================================
// Retrieve string descriptor
//
char*  dec_getStringDesc (const uint8_t idx)
{
	if (!idx)  return "" ;

	return "?todo?";
}
//+============================================================================ ========================================
// Get midi jack type string
//
char* dec_midi_jack_type_t (const uint8_t type)
{
	switch (type) {
		case MIDI_JACK_EMBEDDED : return "EMBEDDED" ;  // 0x01
		case MIDI_JACK_EXTERNAL : return "EXTERNAL" ;  // 0x02
		default                 : return "UNKNOWN"  ;
	}
}

//+============================================================================ ========================================
// Audio Class-Specific AC Interface Descriptor Controls UAC2
//
char*  dec_audio_cs_ac_interface_control_pos_t (const uint8_t b)
{
	switch (b) {
		case AUDIO_CS_AS_INTERFACE_CTRL_LATENCY_POS :  return "LATENCY_POS" ;  // 0
		default                                     :  return "-UNKNOWN-"   ;
	}
}

//+============================================================================ ========================================
// Audio Class-Clock Source Attributes UAC2
//
char*  dec_audio_clock_source_attribute_t (const uint8_t b)
{
	switch (b) {
		case AUDIO_CLOCK_SOURCE_ATT_EXT_CLK     :  return "EXT_CLK"     ;  // 0x00
		case AUDIO_CLOCK_SOURCE_ATT_INT_FIX_CLK :  return "INT_FIX_CLK" ;  // 0x01
		case AUDIO_CLOCK_SOURCE_ATT_INT_VAR_CLK :  return "INT_VAR_CLK" ;  // 0x02
		case AUDIO_CLOCK_SOURCE_ATT_INT_PRO_CLK :  return "INT_PRO_CLK" ;  // 0x03
		case AUDIO_CLOCK_SOURCE_ATT_CLK_SYC_SOF :  return "CLK_SYC_SOF" ;  // 0x04
		default                                 :  return "-UNKNOWN-"   ;
	}
}

//+============================================================================ ========================================
// Audio Class-Clock Source Controls UAC2
//
char*  dec_audio_clock_source_control_pos_t (const uint8_t b)
{
	switch (b) {
		case AUDIO_CLOCK_SOURCE_CTRL_CLK_FRQ_POS :  return "FRQ_POS"   ;  // 0
		case AUDIO_CLOCK_SOURCE_CTRL_CLK_VAL_POS :  return "VAL_POS"   ;  // 2
		default                                  :  return "-UNKNOWN-" ;
	}
}

//+============================================================================ ========================================
// Audio Class-Clock Selector Controls UAC2
//
char*  dec_audio_clock_selector_control_pos_t (const uint8_t b)
{
	switch (b) {
		case AUDIO_CLOCK_SELECTOR_CTRL_POS :  return "POS"       ;  // 0
		default                            :  return "-UNKNOWN-" ;
	}
}

//+============================================================================ ========================================
// Audio Class-Clock Multiplier Controls UAC2
//
char*  dec_audio_clock_multiplier_control_pos_t (const uint8_t b)
{
	switch (b) {
		case AUDIO_CLOCK_MULTIPLIER_CTRL_NUMERATOR_POS   :  return "NUMERATOR_POS"   ;  // 0
		case AUDIO_CLOCK_MULTIPLIER_CTRL_DENOMINATOR_POS :  return "DENOMINATOR_POS" ;  // 2
		default                                          :  return "-UNKNOWN-"       ;
	}
}

//+============================================================================ ========================================
// 2.1 - Audio Class-Terminal Types UAC2
//
char*  dec_audio_terminal_type_t (const uint16_t w)
{
	switch (w) {
		case AUDIO_TERM_TYPE_USB_UNDEFINED   :  return "UNDEFINED"   ;  // 0x0100
		case AUDIO_TERM_TYPE_USB_STREAMING   :  return "STREAMING"   ;  // 0x0101
		case AUDIO_TERM_TYPE_USB_VENDOR_SPEC :  return "VENDOR_SPEC" ;  // 0x01FF
		default                              :  return "-UNKNOWN-"   ;
	}
}

//+============================================================================ ========================================
// 2.2 - Audio Class-Input Terminal Types UAC2
//
char*  dec_audio_terminal_input_type_t (const uint16_t w)
{
	switch (w) {
		case AUDIO_TERM_TYPE_IN_UNDEFINED      :  return "UNDEFINED"      ;  // 0x0200
		case AUDIO_TERM_TYPE_IN_GENERIC_MIC    :  return "GENERIC_MIC"    ;  // 0x0201
		case AUDIO_TERM_TYPE_IN_DESKTOP_MIC    :  return "DESKTOP_MIC"    ;  // 0x0202
		case AUDIO_TERM_TYPE_IN_PERSONAL_MIC   :  return "PERSONAL_MIC"   ;  // 0x0203
		case AUDIO_TERM_TYPE_IN_OMNI_MIC       :  return "OMNI_MIC"       ;  // 0x0204
		case AUDIO_TERM_TYPE_IN_ARRAY_MIC      :  return "ARRAY_MIC"      ;  // 0x0205
		case AUDIO_TERM_TYPE_IN_PROC_ARRAY_MIC :  return "PROC_ARRAY_MIC" ;  // 0x0206
		default                                :  return "-UNKNOWN-"      ;
	}
}

//+============================================================================ ========================================
// Audio Class-Audio Channel Configuration UAC2
//
char*  dec_audio_channel_config_t (const uint32_t d)
{
	switch (d) {
		case AUDIO_CHANNEL_CONFIG_NON_PREDEFINED            :  return "NON_PREDEFINED"            ;  // 0x00000000
		case AUDIO_CHANNEL_CONFIG_FRONT_LEFT                :  return "FRONT_LEFT"                ;  // 0x00000001
		case AUDIO_CHANNEL_CONFIG_FRONT_RIGHT               :  return "FRONT_RIGHT"               ;  // 0x00000002
		case AUDIO_CHANNEL_CONFIG_FRONT_CENTER              :  return "FRONT_CENTER"              ;  // 0x00000004
		case AUDIO_CHANNEL_CONFIG_LOW_FRQ_EFFECTS           :  return "LOW_FRQ_EFFECTS"           ;  // 0x00000008
		case AUDIO_CHANNEL_CONFIG_BACK_LEFT                 :  return "BACK_LEFT"                 ;  // 0x00000010
		case AUDIO_CHANNEL_CONFIG_BACK_RIGHT                :  return "BACK_RIGHT"                ;  // 0x00000020
		case AUDIO_CHANNEL_CONFIG_FRONT_LEFT_OF_CENTER      :  return "FRONT_LEFT_OF_CENTER"      ;  // 0x00000040
		case AUDIO_CHANNEL_CONFIG_FRONT_RIGHT_OF_CENTER     :  return "FRONT_RIGHT_OF_CENTER"     ;  // 0x00000080
		case AUDIO_CHANNEL_CONFIG_BACK_CENTER               :  return "BACK_CENTER"               ;  // 0x00000100
		case AUDIO_CHANNEL_CONFIG_SIDE_LEFT                 :  return "SIDE_LEFT"                 ;  // 0x00000200
		case AUDIO_CHANNEL_CONFIG_SIDE_RIGHT                :  return "SIDE_RIGHT"                ;  // 0x00000400
		case AUDIO_CHANNEL_CONFIG_TOP_CENTER                :  return "TOP_CENTER"                ;  // 0x00000800
		case AUDIO_CHANNEL_CONFIG_TOP_FRONT_LEFT            :  return "TOP_FRONT_LEFT"            ;  // 0x00001000
		case AUDIO_CHANNEL_CONFIG_TOP_FRONT_CENTER          :  return "TOP_FRONT_CENTER"          ;  // 0x00002000
		case AUDIO_CHANNEL_CONFIG_TOP_FRONT_RIGHT           :  return "TOP_FRONT_RIGHT"           ;  // 0x00004000
		case AUDIO_CHANNEL_CONFIG_TOP_BACK_LEFT             :  return "TOP_BACK_LEFT"             ;  // 0x00008000
		case AUDIO_CHANNEL_CONFIG_TOP_BACK_CENTER           :  return "TOP_BACK_CENTER"           ;  // 0x00010000
		case AUDIO_CHANNEL_CONFIG_TOP_BACK_RIGHT            :  return "TOP_BACK_RIGHT"            ;  // 0x00020000
		case AUDIO_CHANNEL_CONFIG_TOP_FRONT_LEFT_OF_CENTER  :  return "TOP_FRONT_LEFT_OF_CENTER"  ;  // 0x00040000
		case AUDIO_CHANNEL_CONFIG_TOP_FRONT_RIGHT_OF_CENTER :  return "TOP_FRONT_RIGHT_OF_CENTER" ;  // 0x00080000
		case AUDIO_CHANNEL_CONFIG_LEFT_LOW_FRQ_EFFECTS      :  return "LEFT_LOW_FRQ_EFFECTS"      ;  // 0x00100000
		case AUDIO_CHANNEL_CONFIG_RIGHT_LOW_FRQ_EFFECTS     :  return "RIGHT_LOW_FRQ_EFFECTS"     ;  // 0x00200000
		case AUDIO_CHANNEL_CONFIG_TOP_SIDE_LEFT             :  return "TOP_SIDE_LEFT"             ;  // 0x00400000
		case AUDIO_CHANNEL_CONFIG_TOP_SIDE_RIGHT            :  return "TOP_SIDE_RIGHT"            ;  // 0x00800000
		case AUDIO_CHANNEL_CONFIG_BOTTOM_CENTER             :  return "BOTTOM_CENTER"             ;  // 0x01000000
		case AUDIO_CHANNEL_CONFIG_BACK_LEFT_OF_CENTER       :  return "BACK_LEFT_OF_CENTER"       ;  // 0x02000000
		case AUDIO_CHANNEL_CONFIG_BACK_RIGHT_OF_CENTER      :  return "BACK_RIGHT_OF_CENTER"      ;  // 0x04000000
		case AUDIO_CHANNEL_CONFIG_RAW_DATA                  :  return "RAW_DATA"                  ;  // 0x80000000
		default                                             :  return "-UNKNOWN-"                 ;
	}
}

//+============================================================================ ========================================
// Audio Class-Input Terminal Controls UAC2
//
char*  dec_audio_terminal_input_control_pos_t (const uint8_t b)
{
	switch (b) {
		case AUDIO_IN_TERM_CTRL_CPY_PROT_POS  :  return "CPY_PROT_POS"  ;  //  0
		case AUDIO_IN_TERM_CTRL_CONNECTOR_POS :  return "CONNECTOR_POS" ;  //  2
		case AUDIO_IN_TERM_CTRL_OVERLOAD_POS  :  return "OVERLOAD_POS"  ;  //  4
		case AUDIO_IN_TERM_CTRL_CLUSTER_POS   :  return "CLUSTER_POS"   ;  //  6
		case AUDIO_IN_TERM_CTRL_UNDERFLOW_POS :  return "UNDERFLOW_POS" ;  //  8
		case AUDIO_IN_TERM_CTRL_OVERFLOW_POS  :  return "OVERFLOW_POS"  ;  // 10
		default                               :  return "-UNKNOWN-"     ;
	}
}

//+============================================================================ ========================================
// 2.3 - Audio Class-Output Terminal Types UAC2
//
char*  dec_audio_terminal_output_type_t (const uint16_t w)
{
	switch (w) {
		case AUDIO_TERM_TYPE_OUT_UNDEFINED               :  return "UNDEFINED"               ;  // 0x0300
		case AUDIO_TERM_TYPE_OUT_GENERIC_SPEAKER         :  return "GENERIC_SPEAKER"         ;  // 0x0301
		case AUDIO_TERM_TYPE_OUT_HEADPHONES              :  return "HEADPHONES"              ;  // 0x0302
		case AUDIO_TERM_TYPE_OUT_HEAD_MNT_DISP_AUIDO     :  return "HEAD_MNT_DISP_AUIDO"     ;  // 0x0303
		case AUDIO_TERM_TYPE_OUT_DESKTOP_SPEAKER         :  return "DESKTOP_SPEAKER"         ;  // 0x0304
		case AUDIO_TERM_TYPE_OUT_ROOM_SPEAKER            :  return "ROOM_SPEAKER"            ;  // 0x0305
		case AUDIO_TERM_TYPE_OUT_COMMUNICATION_SPEAKER   :  return "COMMUNICATION_SPEAKER"   ;  // 0x0306
		case AUDIO_TERM_TYPE_OUT_LOW_FRQ_EFFECTS_SPEAKER :  return "LOW_FRQ_EFFECTS_SPEAKER" ;  // 0x0307
		default                                          :  return "-UNKNOWN-"               ;
	}
}

//+============================================================================ ========================================
// Audio Class-Feature Unit Controls UAC2
//
char*  dec_audio_feature_unit_control_pos_t (const uint8_t b)
{
	switch (b) {
		case AUDIO_FEATURE_UNIT_CTRL_MUTE_POS           :  return "MUTE_POS"           ;  //  0
		case AUDIO_FEATURE_UNIT_CTRL_VOLUME_POS         :  return "VOLUME_POS"         ;  //  2
		case AUDIO_FEATURE_UNIT_CTRL_BASS_POS           :  return "BASS_POS"           ;  //  4
		case AUDIO_FEATURE_UNIT_CTRL_MID_POS            :  return "MID_POS"            ;  //  6
		case AUDIO_FEATURE_UNIT_CTRL_TREBLE_POS         :  return "TREBLE_POS"         ;  //  8
		case AUDIO_FEATURE_UNIT_CTRL_GRAPHIC_EQU_POS    :  return "GRAPHIC_EQU_POS"    ;  // 10
		case AUDIO_FEATURE_UNIT_CTRL_AGC_POS            :  return "AGC_POS"            ;  // 12
		case AUDIO_FEATURE_UNIT_CTRL_DELAY_POS          :  return "DELAY_POS"          ;  // 14
		case AUDIO_FEATURE_UNIT_CTRL_BASS_BOOST_POS     :  return "BASS_BOOST_POS"     ;  // 16
		case AUDIO_FEATURE_UNIT_CTRL_LOUDNESS_POS       :  return "LOUDNESS_POS"       ;  // 18
		case AUDIO_FEATURE_UNIT_CTRL_INPUT_GAIN_POS     :  return "INPUT_GAIN_POS"     ;  // 20
		case AUDIO_FEATURE_UNIT_CTRL_INPUT_GAIN_PAD_POS :  return "INPUT_GAIN_PAD_POS" ;  // 22
		case AUDIO_FEATURE_UNIT_CTRL_PHASE_INV_POS      :  return "PHASE_INV_POS"      ;  // 24
		case AUDIO_FEATURE_UNIT_CTRL_UNDERFLOW_POS      :  return "UNDERFLOW_POS"      ;  // 26
		case AUDIO_FEATURE_UNIT_CTRL_OVERFLOW_POS       :  return "OVERFLOW_POS"       ;  // 28
		default                                         :  return "-UNKNOWN-"          ;
	}
}

//+============================================================================ ========================================
// Audio Class-Specific AS Interface Descriptor Controls UAC2
//
char*  dec_audio_cs_as_interface_control_pos_t (const uint8_t b)
{
	switch (b) {
		case AUDIO_CS_AS_INTERFACE_CTRL_ACTIVE_ALT_SET_POS :  return "ACTIVE_ALT_SET_POS" ;  // 0
		case AUDIO_CS_AS_INTERFACE_CTRL_VALID_ALT_SET_POS  :  return "VALID_ALT_SET_POS"  ;  // 2
		default                                            :  return "-UNKNOWN-"          ;
	}
}

//+============================================================================ ========================================
// A.1 - Audio Class-Format Type Codes UAC2
//
char*  dec_audio_format_type_t (const uint8_t b)
{
	switch (b) {
		case AUDIO_FORMAT_TYPE_UNDEFINED :  return "FORMAT_TYPE_UNDEFINED" ;  // 0x00
		case AUDIO_FORMAT_TYPE_I         :  return "FORMAT_TYPE_I"         ;  // 0x01
		case AUDIO_FORMAT_TYPE_II        :  return "FORMAT_TYPE_II"        ;  // 0x02
		case AUDIO_FORMAT_TYPE_III       :  return "FORMAT_TYPE_III"       ;  // 0x03
		case AUDIO_FORMAT_TYPE_IV        :  return "FORMAT_TYPE_IV"        ;  // 0x04
		case AUDIO_EXT_FORMAT_TYPE_I     :  return "EXT_FORMAT_TYPE_I"     ;  // 0x81
		case AUDIO_EXT_FORMAT_TYPE_II    :  return "EXT_FORMAT_TYPE_II"    ;  // 0x82
		case AUDIO_EXT_FORMAT_TYPE_III   :  return "EXT_FORMAT_TYPE_III"   ;  // 0x83
		default                          :  return "-UNKNOWN-"             ;
	}
}

//+============================================================================ ========================================
// A.2.1 - Audio Class-Audio Data Format Type I UAC2
//
char*  dec_audio_data_format_type_I_t (const uint32_t d)
{
	switch (d) {
		case AUDIO_DATA_FORMAT_TYPE_I_PCM        :  return "PCM"        ;  // 0x00000001
		case AUDIO_DATA_FORMAT_TYPE_I_PCM8       :  return "PCM8"       ;  // 0x00000002
		case AUDIO_DATA_FORMAT_TYPE_I_IEEE_FLOAT :  return "IEEE_FLOAT" ;  // 0x00000004
		case AUDIO_DATA_FORMAT_TYPE_I_ALAW       :  return "ALAW"       ;  // 0x00000008
		case AUDIO_DATA_FORMAT_TYPE_I_MULAW      :  return "MULAW"      ;  // 0x00000010
		case AUDIO_DATA_FORMAT_TYPE_I_RAW_DATA   :  return "RAW_DATA"   ;  // 0x80000000
		default                                  :  return "-UNKNOWN-"  ;
	}
}

//+============================================================================ ========================================
// Get device/interface class string
//
char*  dec_tusb_class_code_t (const uint8_t class)
{
	switch (class) {
		case TUSB_CLASS_UNSPECIFIED          :  return "UNSPECIFIED"          ;  // device
		case TUSB_CLASS_AUDIO                :  return "AUDIO"                ;  // interface
		case TUSB_CLASS_CDC                  :  return "CDC"                  ;  // both
		case TUSB_CLASS_HID                  :  return "HID"                  ;  // interface
		case TUSB_CLASS_RESERVED_4           :  return "RESERVED(4)"          ;
		case TUSB_CLASS_PHYSICAL             :  return "PHYSICAL"             ;  // interface
		case TUSB_CLASS_IMAGE                :  return "IMAGE"                ;  // interface
		case TUSB_CLASS_PRINTER              :  return "PRINTER"              ;  // interface
		case TUSB_CLASS_MSC                  :  return "MSC"                  ;  // interface
		case TUSB_CLASS_HUB                  :  return "HUB"                  ;  // device
		case TUSB_CLASS_CDC_DATA             :  return "CDC DATA"             ;  // interface
		case TUSB_CLASS_SMART_CARD           :  return "SMART CARD"           ;  // interface
		case TUSB_CLASS_RESERVED_12          :  return "RESERVED(12)"         ;
		case TUSB_CLASS_CONTENT_SECURITY     :  return "CONTENT SECURITY"     ;  // interface
		case TUSB_CLASS_VIDEO                :  return "VIDEO"                ;  // interface
		case TUSB_CLASS_PERSONAL_HEALTHCARE  :  return "PERSONAL HEALTHCARE"  ;  // interface
		case TUSB_CLASS_AUDIO_VIDEO          :  return "AUDIO/VIDEO"          ;  // interface
		case TUSB_CLASS_DIAGNOSTIC           :  return "DIAGNOSTIC"           ;  // both
		case TUSB_CLASS_WIRELESS_CONTROLLER	 :  return "WIRELESS CONTROLLER"  ;  // interface
		case TUSB_CLASS_MISC                 :  return "MISC"                 ;  // both
		case TUSB_CLASS_APPLICATION_SPECIFIC :  return "APPLICATION SPECIFIC" ;  // interface
		case TUSB_CLASS_VENDOR_SPECIFIC      :  return "VENDOR SPECIFIC"      ;  // both
		default	                             :  return "-UNKNOWN-"            ;
	}
}

//+============================================================================ ========================================
// Get interface sub-class string
//
char*  dec_subClass (const uint8_t class, const uint8_t subclass)
{
	switch (class) {
		case TUSB_CLASS_AUDIO :
			switch(subclass) {
				case TUSB_CLASS_AUDIO_UNDEFINED      :  return "UNDEFINED"        ;
				case TUSB_CLASS_AUDIO_AUDIO_CONTROL  :  return "AUDIO CONTROL"    ;
				case TUSB_CLASS_AUDIO_AUDIOSTREAMING :  return "AUDIOSTREAMING"   ;
				case TUSB_CLASS_AUDIO_MIDISTREAMING  :  return "MIDISTREAMING"    ;
				default                              :  return "UNKNOWN SUBCLASS" ;
			}
			break;
		case TUSB_CLASS_HID	:
			switch(subclass) {
				case TUSB_CLASS_HID_NONE             :  return "NO SUBCLASS"      ;
				case TUSB_CLASS_HID_BOOT_INTERFACE   :  return "BOOT INTERFACE"   ;
				default                              :  return "RESERVED"         ;
			}
		default	:  return "SUBCLASSES [TODO]" ;
	}
}

//+============================================================================ ========================================
// Get descriptor type string
//
char*  dec_tusb_desc_type_t (const uint8_t type)
{
	switch (type) {
		case TUSB_DESC_DEVICE                            :  return "DEVICE"                            ;  // 0x01
		case TUSB_DESC_CONFIGURATION                     :  return "CONFIGURATION"                     ;  // 0x02
		case TUSB_DESC_STRING                            :  return "STRING"                            ;  // 0x03
		case TUSB_DESC_INTERFACE                         :  return "INTERFACE"                         ;  // 0x04
		case TUSB_DESC_ENDPOINT                          :  return "ENDPOINT"                          ;  // 0x05
		case TUSB_DESC_DEVICE_QUALIFIER                  :  return "DEVICE QUALIFIER"                  ;  // 0x06
		case TUSB_DESC_OTHER_SPEED_CONFIG                :  return "OTHER SPEED CONFIG"                ;  // 0x07
		case TUSB_DESC_INTERFACE_POWER                   :  return "INTERFACE POWER"                   ;  // 0x08
		case TUSB_DESC_OTG                               :  return "OTG"                               ;  // 0x09
		case TUSB_DESC_DEBUG                             :  return "DEBUG"                             ;  // 0x0A
		case TUSB_DESC_INTERFACE_ASSOCIATION             :  return "INTERFACE ASSOCIATION"             ;  // 0x0B
		case TUSB_DESC_BOS                               :  return "BOS"                               ;  // 0x0F
		case TUSB_DESC_DEVICE_CAPABILITY                 :  return "DEVICE CAPABILITY"                 ;  // 0x10
//      case TUSB_DESC_FUNCTIONAL                        :  return "FUNCTIONAL"                        ;  // 0x21
		case TUSB_DESC_CS_DEVICE                         :  return "CLASS SPECIFIC DEVICE"             ;  // 0x21
		case TUSB_DESC_CS_CONFIGURATION                  :  return "CLASS SPECIFIC CONFIGURATION"      ;  // 0x22
		case TUSB_DESC_CS_STRING                         :  return "CLASS SPECIFIC STRING"             ;  // 0x23
		case TUSB_DESC_CS_INTERFACE                      :  return "CLASS SPECIFIC INTERFACE"          ;  // 0x24
		case TUSB_DESC_CS_ENDPOINT                       :  return "CLASS SPECIFIC ENDPOINT"           ;  // 0x25
		case TUSB_DESC_SUPERSPEED_ENDPOINT_COMPANION     :  return "SUPERSPEED ENDPOINT COMPANION"     ;  // 0x30
		case TUSB_DESC_SUPERSPEED_ISO_ENDPOINT_COMPANION :  return "SUPERSPEED ISO ENDPOINT COMPANION" ;  // 0x31
		default                                          :  return "UNKNOWN DESCRIPTOR TYPE"           ;
	}
}

//+============================================================================ ========================================
//
//
bool  dec_TUSB_DESC_STRING (const void* const vp)
{
	const tusb_desc_string_t* const  p = vp;

	char  s[TUSB_STRING_MAX];

	declogf("TUSB_DESC_STRING" EOL);
	declogf(IND"  bLength                    = %d"             EOL, p->bLength        );
	declogf(IND"  bDescriptorType            = %0x02X"         EOL, p->bDescriptorType);
	declogf(IND"  unicode_string[]           = \"%s\" (ascii)" EOL,
	            dec_unicode2asc(p->unicode_string, p->bLength - 2, s, TUSB_STRING_MAX));
	return true;
}

//+============================================================================ ========================================
//
//
